src/example/InformationRegisters/ЛогHTTPЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛогHTTPЗапросов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурс</Name>
					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>HTTPСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.HTTPСервисы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/example/CommonModules/ОбработчикHTTPСервисЗапроса/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Выполняет поэтапную обработку запроса.
//
// Параметры:
//  Контекст - Структура
//
// Возвращаемое значение:
//  HTTPСервисОтвет
//
Функция ВыполнитьОбработку(Контекст) Экспорт
	
	Этапы = НовыйЭтапы();
	
	Для Каждого Этап Из Этапы Цикл
		ВыполнитьЭтап(Контекст, Этап);
	КонецЦикла;
	
	Возврат Контекст.HTTPСервисОтвет;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЭтапыВыполнения

// Этап выполняет автоматическую проверку запроса.
//
// Параметры:
//  Контекст - Структура
//
Процедура АвтоматическаяПроверкаЗапроса(Контекст) // BSLLS:UnusedLocalMethod-off
	
	Если ЕстьОшибки(Контекст) Тогда
		Возврат;
	КонецЕсли;
	
	HTTPСервисЗапросыСлужебный.ПроверитьЗапрос(
		Контекст.Схема, Контекст.Запрос, Контекст.ОшибкиКлиента);
	
КонецПроцедуры

// Этап выполняет автоматическую проверку ответа.
//
// Параметры:
//  Контекст - Структура
//
Процедура АвтоматическаяПроверкаОтвета(Контекст) // BSLLS:UnusedLocalMethod-off
	
	Если ЕстьОшибки(Контекст) Тогда
		Возврат;
	КонецЕсли;
	
	Ошибки = Новый Массив;
	HTTPСервисЗапросыСлужебный.ПроверитьОтвет(
		Контекст.Схема, Контекст.Ответ, Ошибки);
	
	Если Ошибки.Количество() > 0 Тогда
		ДобавитьОшибку(Контекст.ОшибкиСервера, ТекстВнутреннейОшибки());
	КонецЕсли;
	
КонецПроцедуры

// Этап инициализирует контекст.
//
// Параметры:
//  Контекст - Структура
//
Процедура Инициализация(Контекст) // BSLLS:UnusedLocalMethod-off
	
	НастройкиHTTPСервиса = Справочники.HTTPСервисы.НастройкиHTTPСервиса(Контекст.HTTPСервис);
	
	Если НастройкиHTTPСервиса = Неопределено Тогда
		ДобавитьОшибку(Контекст.ОшибкиСервера, ТекстВнутреннейОшибки());
		Возврат;
	КонецЕсли;
	
	Если НЕ НастройкиHTTPСервиса.Включен Тогда
		ДобавитьОшибку(Контекст.ОшибкиСервера, НСтр("ru = 'HTTP-сервис выключен.'"));
		Возврат;
	КонецЕсли;
	
	Схема = Справочники.СхемыHTTPСервисов.СхемаПоИдентификатору(
		НастройкиHTTPСервиса.Схема, НастройкиHTTPСервиса.Идентификатор);
	
	Если НЕ ЗначениеЗаполнено(Схема) Тогда
		ДобавитьОшибку(Контекст.ОшибкиСервера, ТекстВнутреннейОшибки());
		Возврат;
	КонецЕсли;
	
	Контекст.Включен = НастройкиHTTPСервиса.Включен;
	Контекст.Схема = Схема;
	Контекст.ОбработчикЗапроса = Обработки.ОбработчикHTTPСервисЗапроса.Создать();
	Контекст.ОбработчикЗапроса.Инициализировать(Контекст);
	Контекст.ОбработчикОтвета = Обработки.ОбработчикHTTPСервисОтвета.Создать();
	Контекст.ОбработчикОтвета.Инициализировать(Контекст);
	
	ЗаполнитьЗначенияСвойств(Контекст.Запрос, Контекст.HTTPСервисЗапрос);
	Контекст.Запрос.Агент = Контекст.ОбработчикЗапроса.Заголовок("User-Agent");
	Контекст.Запрос.ВнешнийИдентификатор = Контекст.ОбработчикЗапроса.Заголовок("X-Request-ID");
	Контекст.Запрос.Заголовки = Новый Соответствие(Контекст.HTTPСервисЗапрос.Заголовки);
	Контекст.Запрос.Метод = ВРег(Контекст.HTTPСервисЗапрос.HTTPМетод);
	Контекст.Запрос.ПараметрыURL = Новый Соответствие(Контекст.HTTPСервисЗапрос.ПараметрыURL);
	Контекст.Запрос.ПараметрыЗапроса = Новый Соответствие(Контекст.HTTPСервисЗапрос.ПараметрыЗапроса);
	Контекст.Запрос.ТелоКакДвоичныеДанные = Контекст.HTTPСервисЗапрос.ПолучитьТелоКакДвоичныеДанные();
	Контекст.Запрос.ТелоКакСтрока = Контекст.HTTPСервисЗапрос.ПолучитьТелоКакСтроку();
	Контекст.Запрос.ТипКонтента = ОпределитьТипКонтента(Контекст.Схема.ТелоЗапроса, Контекст.HTTPСервисЗапрос.Заголовки);
	
	Если СхемыHTTPСервисовПовтИсп.ЭтоТипКонтентаJSON(Контекст.Запрос.ТипКонтента) Тогда
		Попытка
			Контекст.Запрос.ТелоКакОбъект = СериализацияДанных.ПрочитатьДанныеJSON(Контекст.Запрос.ТелоКакСтрока);
		Исключение
			ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации("ОбработчикHTTPСервисЗапроса.Инициализация",
				УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
			ОписаниеОшибки = НСтр("ru = 'Не удалось сериализовать тело запроса из JSON.'");
			ДобавитьОшибку(Контекст.ОшибкиКлиента, ОписаниеОшибки);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Этап выполняет запуск обработчиков запроса.
//
// Параметры:
//  Контекст - Структура
//
Процедура ОбработкаЗапроса(Контекст) // BSLLS:UnusedLocalMethod-off
	
	Если ЕстьОшибки(Контекст) Тогда
		Возврат;
	КонецЕсли;
	
	Обработчики = HTTPСервисЗапросыСлужебный.ОбработчикиЗапросов();
	Обработчик = НайтиОбработчик(Контекст, Обработчики);
	
	Если Обработчик = Неопределено Тогда
		ОписаниеОшибки = НСтр("ru = 'Не найден обработчик запроса.'");
		ЗаписьЖурналаРегистрации("ОбработчикHTTPСервисЗапроса.ОбработкаЗапроса",
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		ДобавитьОшибку(Контекст.ОшибкиСервера, ТекстВнутреннейОшибки());
		Возврат;
	КонецЕсли;
	
	Попытка
		ВыполнитьОбработчик(Контекст, Обработчик);
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ОбработчикHTTPСервисЗапроса.ОбработкаЗапроса",
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		ДобавитьОшибку(Контекст.ОшибкиСервера, ТекстВнутреннейОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Этап подготавливает ответ для проверки.
//
// Параметры:
//  Контекст - Структура
//
Процедура ПодготовкаОтвета(Контекст) // BSLLS:UnusedLocalMethod-off
	
	Если ЕстьОшибки(Контекст) Тогда
		Возврат;
	КонецЕсли;
	
	Контекст.Ответ.ТипКонтента = ОпределитьТипКонтентаОтвета(
		Контекст.Схема.Ответы, Контекст.Ответ.Заголовки, Контекст.Ответ.КодСостояния);
	
КонецПроцедуры

// Этап выполняет запуск обработчиков проверки запроса.
//
// Параметры:
//  Контекст - Структура
//
Процедура ПроверкаЗапроса(Контекст) // BSLLS:UnusedLocalMethod-off
	
	Если ЕстьОшибки(Контекст) Тогда
		Возврат;
	КонецЕсли;
	
	Обработчики = HTTPСервисЗапросыСлужебный.ОбработчикиПроверкиЗапросов();
	Обработчик = НайтиОбработчик(Контекст, Обработчики);
	
	Если Обработчик = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ВыполнитьОбработчик(Контекст, Обработчик);
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ОбработчикHTTPСервисЗапроса.ПроверкаЗапроса",
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		ДобавитьОшибку(Контекст.ОшибкиСервера, ТекстВнутреннейОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Этап выполняет запуск обработчиков проверки ответа.
//
// Параметры:
//  Контекст - Структура
//
Процедура ПроверкаОтвета(Контекст) // BSLLS:UnusedLocalMethod-off
	
	Если ЕстьОшибки(Контекст) Тогда
		Возврат;
	КонецЕсли;
	
	Обработчики = HTTPСервисЗапросыСлужебный.ОбработчикиПроверкиОтветов();
	Обработчик = НайтиОбработчик(Контекст, Обработчики);
	
	Если Обработчик = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ВыполнитьОбработчик(Контекст, Обработчик);
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ОбработчикHTTPСервисЗапроса.ПроверкаОтвета",
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		ДобавитьОшибку(Контекст.ОшибкиСервера, ТекстВнутреннейОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Этап выполняет запуск обработчиков проверки прав доступа.
//
// Параметры:
//  Контекст - Структура
//
Процедура ПроверкаПравДоступа(Контекст) // BSLLS:UnusedLocalMethod-off
	
	Если ЕстьОшибки(Контекст) Тогда
		Возврат;
	КонецЕсли;
	
	Обработчики = HTTPСервисЗапросыСлужебный.ОбработчикиПроверкиПравДоступа();
	Обработчик = НайтиОбработчик(Контекст, Обработчики);
	
	Если Обработчик = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ВыполнитьОбработчик(Контекст, Обработчик);
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ОбработчикHTTPСервисЗапроса.ПроверкаПравДоступа",
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		ДобавитьОшибку(Контекст.ОшибкиСервера, ТекстВнутреннейОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Этап фиксирует входящий запрос в логе HTTP запросов.
//
// Параметры:
//  Контекст - Структура
//
Процедура РегистрацияЗапроса(Контекст) // BSLLS:UnusedLocalMethod-off
	
	ОбеспечитьИдентификаторЗапроса(Контекст);
	
	Обработчики = HTTPСервисЗапросыСлужебный.ОбработчикиРегистрацииЗапроса();
	Обработчик = НайтиОбработчик(Контекст, Обработчики);
	
	Если Обработчик = Неопределено Тогда
		РегистрыСведений.ЛогHTTPЗапросов.ЗафиксироватьЗапрос(Контекст);
		Возврат;
	КонецЕсли;
	
	Попытка
		ВыполнитьОбработчик(Контекст, Обработчик);
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ОбработчикHTTPСервисЗапроса.РегистрацияЗапроса",
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Этап дополняет запись лога HTTP запросов ответом и кодом состояния.
//
// Параметры:
//  Контекст - Структура
//
Процедура РегистрацияОтвета(Контекст) // BSLLS:UnusedLocalMethod-off
	
	Обработчики = HTTPСервисЗапросыСлужебный.ОбработчикиРегистрацииОтвета();
	Обработчик = НайтиОбработчик(Контекст, Обработчики);
	
	Если Обработчик = Неопределено Тогда
		РегистрыСведений.ЛогHTTPЗапросов.ЗафиксироватьОтвет(Контекст);
		Возврат;
	КонецЕсли;
	
	Попытка
		ВыполнитьОбработчик(Контекст, Обработчик);
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("ОбработчикHTTPСервисЗапроса.РегистрацияОтвета",
			УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
	КонецПопытки;
	
КонецПроцедуры

// Этап формирует HTTP-ответ.
//
// Параметры:
//  Контекст - Структура
//
Процедура ФормированиеОтвета(Контекст) // BSLLS:UnusedLocalMethod-off
	
	Если Контекст.ОшибкиПравДоступа.Количество() > 0 Тогда
		ЗаполнитьРезультатОшибка(Контекст, Контекст.ОшибкиПравДоступа, 403);
	ИначеЕсли Контекст.ОшибкиКлиента.Количество() > 0 Тогда
		ЗаполнитьРезультатОшибка(Контекст, Контекст.ОшибкиКлиента, 400);
	ИначеЕсли Контекст.ОшибкиСервера.Количество() > 0 Тогда
		ЗаполнитьРезультатОшибка(Контекст, Контекст.ОшибкиСервера, 500);
	Иначе
		ЗаполнитьРезультатУспешно(Контекст);
	КонецЕсли;
	
	Контекст.HTTPСервисОтвет = Новый HTTPСервисОтвет(
		Контекст.Результат.КодСостояния,
		Контекст.Результат.Причина,
		Контекст.Результат.Заголовки);
	
	Если ТипЗнч(Контекст.Результат.Тело) = Тип("ДвоичныеДанные") Тогда
		Контекст.HTTPСервисОтвет.УстановитьТелоИзДвоичныхДанных(Контекст.Результат.Тело);
	Иначе
		Контекст.HTTPСервисОтвет.УстановитьТелоИзСтроки(Контекст.Результат.Тело);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Конструкторы

// Конструктор новых этапов выполнения.
//
// Возвращаемое значение:
//  Массив из Строка
//
Функция НовыйЭтапы()
	
	Этапы = Новый Массив;
	Этапы.Добавить("Инициализация");
	Этапы.Добавить("РегистрацияЗапроса"); // Переопределяемый
	Этапы.Добавить("ПроверкаПравДоступа"); // Переопределяемый
	Этапы.Добавить("АвтоматическаяПроверкаЗапроса");
	Этапы.Добавить("ПроверкаЗапроса"); // Переопределяемый
	Этапы.Добавить("ОбработкаЗапроса"); // Переопределяемый
	Этапы.Добавить("ПодготовкаОтвета");
	Этапы.Добавить("АвтоматическаяПроверкаОтвета");
	Этапы.Добавить("ПроверкаОтвета"); // Переопределяемый
	Этапы.Добавить("ФормированиеОтвета");
	Этапы.Добавить("РегистрацияОтвета"); // Переопределяемый
	Возврат Этапы;
	
КонецФункции

#КонецОбласти

// Выполняет обработчик запроса или ответа.
//
// Параметры:
//  Контекст - Структура
//  ОписаниеОбработчика - СтрокаТаблицыЗначений
//
Процедура ВыполнитьОбработчик(Контекст, ОписаниеОбработчика) Экспорт
	
	// BSLLS:WrongUseOfRollbackTransactionMethod-off
	// BSLLS:BeginTransactionBeforeTryCatch-off
	Если ОписаниеОбработчика.ВПривилегированномРежиме Тогда
		УстановитьПривилегированныйРежим(Истина); // BSLLS:SetPrivilegedMode-off
	КонецЕсли;
	
	Если ОписаниеОбработчика.ВТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;
	
	Попытка
		Метод = СтрШаблон("%1(Контекст.ОбработчикЗапроса, Контекст.ОбработчикОтвета)", ОписаниеОбработчика.Обработчик);
		Выполнить(Метод); // BSLLS:ExecuteExternalCodeInCommonModule-off
		
		Если ОписаниеОбработчика.ВТранзакции Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
	Исключение
		Если ОписаниеОбработчика.ВТранзакции И ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		Если ОписаниеОбработчика.ВПривилегированномРежиме Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
		ВызватьИсключение;
	КонецПопытки;
	
	Если ОписаниеОбработчика.ВПривилегированномРежиме Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	// BSLLS:WrongUseOfRollbackTransactionMethod-on
	// BSLLS:BeginTransactionBeforeTryCatch-on
	
КонецПроцедуры

// Выполняет обработчик этапа.
//
// Параметры:
//  Контекст - Структура
//  Этап - Строка
//
Процедура ВыполнитьЭтап(Контекст, Этап)
	
	Попытка
		Метод = СтрШаблон("%1(Контекст)", Этап);
		Выполнить(Метод); // BSLLS:ExecuteExternalCodeInCommonModule-off
	Исключение
		ДобавитьОшибку(Контекст.ОшибкиСервера, ТекстВнутреннейОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Добавляет ошибку.
//
// Параметры:
//  Ошибки - Массив из Структура
//  Текст - Строка
//
Процедура ДобавитьОшибку(Ошибки, Текст) Экспорт
	
	Ошибки.Добавить(Текст);
	
КонецПроцедуры

// Проверяет наличие ошибок клиента, сервера или прав доступа.
//
// Параметры:
//  Контекст - Структура
//
// Возвращаемое значение:
//  Булево
//
Функция ЕстьОшибки(Контекст)
	
	Возврат Контекст.ОшибкиКлиента.Количество() > 0
		ИЛИ Контекст.ОшибкиПравДоступа.Количество() > 0
		ИЛИ Контекст.ОшибкиСервера.Количество() > 0;
	
КонецФункции

// Заполняет идентификатор запроса в контексте, если он ещё не задан.
//
// Параметры:
//  Контекст - Структура
//
Процедура ОбеспечитьИдентификаторЗапроса(Контекст)
	
	Если ЗначениеЗаполнено(Контекст.ИдентификаторЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	ВнешнийИдентификатор = Контекст.Запрос.ВнешнийИдентификатор;
	
	Если СтрДлина(ВнешнийИдентификатор) = 36 Тогда
		Контекст.ИдентификаторЗапроса = ВнешнийИдентификатор;
	Иначе
		Контекст.ИдентификаторЗапроса = XMLСтрока(Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет результат при ошибке.
//
// Параметры:
//  Контекст - Структура
//  Ошибки - Массив из Строка
//  КодСостояния - Число
//
Процедура ЗаполнитьРезультатОшибка(Контекст, Ошибки, КодСостояния)
	
	Тело = ТелоОтветаОшибка(Ошибки);
	Контекст.Результат.КодСостояния = КодСостояния;
	Контекст.Результат.Тело = СериализацияДанных.ЗаписатьДанныеJSON(Тело);
	Контекст.Результат.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
КонецПроцедуры

// Заполняет результат при успешном выполнении.
//
// Параметры:
//  Контекст - Структура
//
Процедура ЗаполнитьРезультатУспешно(Контекст)
	
	Тело = ТелоПоТипуКонтента(Контекст.Ответ);
	
	Если Коллекции.ЭтоКоллекция(Тело) Тогда
		Тело = СериализацияДанных.ЗаписатьДанныеJSON(Тело);
	ИначеЕсли Тело = Неопределено Тогда
		Тело = "";
	КонецЕсли; // BSLLS:IfElseIfEndsWithElse-off
	
	Контекст.Результат.КодСостояния = Контекст.Ответ.КодСостояния;
	Контекст.Результат.Причина = Контекст.Ответ.Причина;
	Контекст.Результат.Тело = Тело;
	Контекст.Результат.Заголовки = Контекст.Ответ.Заголовки;
	
КонецПроцедуры

// Возвращает значение свойства по ключу без учета регистра.
// Если ключ не найден, возвращает значение по умолчанию.
//
// Параметры:
//  Коллекция - Структура, Соответствие
//  Ключ - Строка
//  ЗначениеПоУмолчанию - Произвольный
//
// Возвращаемое значение:
//  Произвольный
//
Функция ЗначениеСвойства(Коллекция, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Для Каждого ЭлементКоллекции Из Коллекция Цикл
		Если НРег(ЭлементКоллекции.Ключ) = НРег(Ключ) Тогда
			Возврат ЭлементКоллекции.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции

// Ищет подходящий обработчик в таблице обработчиков обновления.
//
// Параметры:
//  Контекст - Структура
//  Обработчики - ТаблицыЗначени
//
// Возвращаемое значение:
//  - СтрокаТаблицыЗначений
//  - Неопределено
//
Функция НайтиОбработчик(Контекст, Обработчики)
	
	Возврат Обработчики.Найти(Контекст.HTTPСервис, "HTTPСервис");
	
КонецФункции

// Возвращает тип контента из схемы и заголовков.
//
// Параметры:
//  Схема - Структура
//  Заголовки - Соответствие
//
// Возвращаемое значение:
//  Строка
//
Функция ОпределитьТипКонтента(Схема, Заголовки)
	
	ТипыКонтента = СхемыHTTPСервисовПовтИсп.ТипыКонтента();
	Результат = ТипыКонтента.Неизвестный;
	
	Если Схема.Количество() = 0 Тогда
		Результат = ТипыКонтента.НетКонтента;
	ИначеЕсли Схема.Количество() = 1 Тогда
		Результат = СхемыHTTPСервисовПовтИсп.ТипКонтента(Схема[0].Тип);
	Иначе
		ЗаголовокТипКонтента = ЗначениеСвойства(Заголовки, "Content-Type");
		
		Если ЗначениеЗаполнено(ЗаголовокТипКонтента) Тогда
			Для Каждого ВложеннаяСхема Из Схема Цикл
				ТипКонтентаИзСхемы = СхемыHTTPСервисовПовтИсп.ТипКонтента(ВложеннаяСхема.Тип);
				ТипКонтентаИзЗаголовка = СхемыHTTPСервисовПовтИсп.ТипКонтента(ЗаголовокТипКонтента);
				
				Если ТипКонтентаИзСхемы = ТипКонтентаИзЗаголовка Тогда
					Результат = ТипКонтентаИзСхемы;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает тип контента ответа из схемы и заголовков.
//
// Параметры:
//  Схема - Структура
//  Заголовки - Соответствие
//  КодСостояния - Число
//
// Возвращаемое значение:
//  Строка
//
Функция ОпределитьТипКонтентаОтвета(Схема, Заголовки, КодСостояния)
	
	ТипыКонтента = СхемыHTTPСервисовПовтИсп.ТипыКонтента();
	Результат = ТипыКонтента.Неизвестный;
	
	Если Схема.Количество() = 0 Тогда
		Результат = ТипыКонтента.НетКонтента;
	Иначе
		ВложенныеСхемы = Новый Массив;
		
		Для Каждого ВложеннаяСхема Из Схема Цикл
			Если ВложеннаяСхема.КодСостояния = КодСостояния Тогда
				ВложенныеСхемы.Добавить(ВложеннаяСхема);
			КонецЕсли;
		КонецЦикла;
		
		Результат = ОпределитьТипКонтента(ВложенныеСхемы, Заголовки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает текст внутренней ошибки сервера.
//
// Возвращаемое значение:
//  Строка
//
Функция ТекстВнутреннейОшибки()
	
	Возврат НСтр("ru = 'Внутренняя ошибка сервера. Подробнее в журнале регистрации.'");
	
КонецФункции

// Возвращает тело ответа с ошибкой.
//
// Параметры:
//  Ошибки - Массив из Строка
//
// Возвращаемое значение:
//  Структура
//
Функция ТелоОтветаОшибка(Ошибки)
	
	Тело = Новый Структура("errors", Новый Массив);
	
	Для Каждого Ошибка Из Ошибки Цикл
		ОписаниеОшибки = Новый Структура("message", Ошибка);
		Тело.errors.Добавить(ОписаниеОшибки);
	КонецЦикла;
	
	Возврат Тело;
	
КонецФункции

// Возвращает тело по типу контента.
//
// Параметры:
//  Источник - Структура
//
// Возвращаемое значение:
//  - Строка
//  - ДвоичныеДанные
//  - Массив, Структура, Соответствие
//  - Неопределено
//
Функция ТелоПоТипуКонтента(Источник)
	
	Если СхемыHTTPСервисовПовтИсп.ЭтоТипКонтентаJSON(Источник.ТипКонтента) Тогда
		Результат = Источник.ТелоКакОбъект;
	ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипКонтентаДвоичныеДанные(Источник.ТипКонтента) Тогда
		Результат = Источник.ТелоКакДвоичныеДанные;
	ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипКонтентаСтрока(Источник.ТипКонтента) Тогда
		Результат = Источник.ТелоКакСтрока;
	ИначеЕсли СхемыHTTPСервисовПовтИсп.ЭтоТипКонтентаНетКонтента(Источник.ТипКонтента) Тогда
		Результат = "";
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
